app/views/projects/_form.html.erb

    <%= form.label :category_id, "Select Category" %>
    <%= form.collection_select :category_id, Category.all, :id, :username, prompt: "No Category", :selected => @project.category_id  %>
---
SELECT "categories".* FROM "categories"