app/views/projects/index.html.erb

        <td><%= project.title %></td>
        <% if  project.category_id.present? %>
---
SELECT "categories".* FROM "categories"