app/views/projects/show.html.erb

SELECT "project_promises".* FROM "project_promises" WHERE (project_id= 1)
---
			    <td><%= project_funding.user.username %></td>
			    <% if project_funding.project_promise.present? %>