app/controllers/categories_controller.rb

  def create
    @category = Category.new(category_params)

    respond_to do |format|
      if @category.save
---
INSERT INTO "categories" ("username", "created_at", "updated_at") VALUES (?, ?, ?)  [["username", "asdasd"], ["created_at", "2018-05-05 04:28:33.848183"], ["updated_at", "2018-05-05 04:28:33.848183"]]

  def update
    respond_to do |format|
      if @category.update(category_params)
---
UPDATE "categories" SET "username" = ?, "updated_at" = ? WHERE "categories"."id" = ?  [["username", "asd"], ["updated_at", "2018-05-26 00:47:05.375053"], ["id", 3]]