app/controllers/projects_controller.rb

SELECT "categories".* FROM "categories"
SELECT "projects".* FROM "projects" WHERE (user_id = 1) AND (category_id= '1')
SELECT  "categories".* FROM "categories" WHERE "categories"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "projects".* FROM "projects" WHERE (user_id = 1) AND "projects"."outstanding" = ?  [["outstanding", "t"]]
SELECT SUM("project_fundings"."amount") FROM "project_fundings" WHERE (project_id= 1)
---
  def index
    @categories = Category.all

    if params[:my_projects] && params[:category].present?
        @projects = Project.where("user_id = ?", current_user.id).where("category_id= ?", params[:category])
    elsif params[:my_projects] && params[:outstanding]
        @projects = Project.where("user_id = ?", current_user.id).where(outstanding: true)
    elsif params[:my_projects] && params[:funded]
        @allprojects = Project.where("user_id = ?", current_user.id)
	@projects = []
	@allprojects.each do |project|
	  @sum = ProjectFunding.where("project_id= ?",project.id).sum(:amount)

SELECT  "project_promises".* FROM "project_promises" WHERE "project_promises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "project_fundings".* FROM "project_fundings" WHERE (project_id= 1)
SELECT SUM("project_fundings"."amount") FROM "project_fundings" WHERE (project_id= 1)
---
  def show
    @project_promises = ProjectPromise.where("project_id= ?",@project.id)
    @project_fundings = ProjectFunding.where("project_id= ?",@project.id)
    @sum = ProjectFunding.where("project_id= ?",@project.id).sum(:amount)

INSERT INTO "project_fundings" ("project_id", "user_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["project_id", 2], ["user_id", 1], ["amount", 10], ["created_at", "2018-05-25 23:16:58.914708"], ["updated_at", "2018-05-25 23:16:58.914708"]]
---
  def create_funding
    @funding = ProjectFunding.new(project_id: params[:project_id], user_id: current_user.id, amount: params[:amount])
    if @funding.save

SELECT  "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "projects" SET "outstanding" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["outstanding", "f"], ["updated_at", "2018-05-25 05:13:01.238706"], ["id", 1]]
---
  def make_outstanding
      @project = Project.find(params[:format])
      @project.update(outstanding: !@project.outstanding?)

SELECT "user_wishlists".* FROM "user_wishlists" WHERE (user_id = 1 ) AND (project_id = '6' )
INSERT INTO "user_wishlists" ("user_id", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 1], ["project_id", 6], ["created_at", "2018-05-26 00:57:46.461595"], ["updated_at", "2018-05-26 00:57:46.461595"]]
---
  def add_to_wishlist
      @UserWishlist = UserWishlist.where("user_id = ? ", current_user.id).where("project_id = ? ", params[:format])
      if !@UserWishlist.present?
      	UserWishlist.create(user_id: current_user.id, project_id: params[:format])

INSERT INTO "project_promises" ("project_id", "description", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["project_id", 4], ["description", "ASDF"], ["cost", 100], ["created_at", "2018-05-25 22:48:33.086991"], ["updated_at", "2018-05-25 22:48:33.086991"]]
---
  def create_promise
    @promise = ProjectPromise.new(project_id: params[:project_id], description: params[:description], cost: params[:cost])
    if @promise.save

SELECT  "project_promises".* FROM "project_promises" WHERE "project_promises"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "project_fundings" ("project_id", "user_id", "project_promise_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["project_id", 2], ["user_id", 1], ["project_promise_id", 3], ["amount", 1000], ["created_at", "2018-05-25 22:48:06.853037"], ["updated_at", "2018-05-25 22:48:06.853037"]]
---
  def fund_through_promise
      @promise = ProjectPromise.find(params[:promise_id])
      ProjectFunding.create(project_id: params[:format], user_id: current_user.id, project_promise_id: @promise.id, amount: @promise.cost)

INSERT INTO "projects" ("user_id", "title", "description", "goal_amount", "finish_date", "delivery_date", "created_at", "updated_at", "category_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @project = Project.new(project_params)
    @project.user_id = current_user.id
    respond_to do |format|
      if @project.save

UPDATE "projects" SET "description" = ?, "updated_at" = ? WHERE "projects"."id" = ?  [["description", "A game which is good.adalñsdlkalñsd kakñlslkañlsk dlñklañskdlñaskñdllñkaslñd klñaskldñlñkdalskñlñk ñkl"], ["updated_at", "2018-05-26 00:05:21.678605"], ["id", 2]]
---
  def update
    respond_to do |format|
      if @project.update(project_params)