app/controllers/project_promises_controller.rb

SELECT "project_promises".* FROM "project_promises"
---
  def index
    @project_promises = ProjectPromise.all

INSERT INTO "project_promises" ("project_id", "description", "cost", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["project_id", 2], ["description", "polera"], ["cost", 123], ["created_at", "2018-04-13 04:12:29.429362"], ["updated_at", "2018-04-13 04:12:29.429362"]]
---
  def create
    @project_promise = ProjectPromise.new(project_promise_params)

    respond_to do |format|
      if @project_promise.save

DELETE FROM "project_promises" WHERE "project_promises"."id" = ?  [["id", 1]]
---
  def destroy
    @project_promise.destroy

SELECT  "project_promises".* FROM "project_promises" WHERE "project_promises"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_project_promise
      @project_promise = ProjectPromise.find(params[:id])