app/controllers/project_fundings_controller.rb

SELECT "project_fundings".* FROM "project_fundings"
---
  def index
    @project_fundings = ProjectFunding.all

INSERT INTO "project_fundings" ("project_id", "user_id", "project_promise_id", "amount", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["project_id", 2], ["user_id", 2], ["project_promise_id", 1], ["amount", 123], ["created_at", "2018-04-13 04:26:55.573682"], ["updated_at", "2018-04-13 04:26:55.573682"]]
---
  def create
    @project_funding = ProjectFunding.new(project_funding_params)

    respond_to do |format|
      if @project_funding.save

SELECT  "project_fundings".* FROM "project_fundings" WHERE "project_fundings"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_project_funding
      @project_funding = ProjectFunding.find(params[:id])