app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("username", "name", "last_name", "phone", "address", "email", "password", "last_access", "role", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "name" = ?, "encrypted_password" = ?, "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "nic1"], ["encrypted_password", "$2a$11$bupBIqqjo8jNxwcM6pN/CuEhmIMq/PTQbogIMuJ20kXpUyxKRKFJC"], ["role", "f"], ["updated_at", "2018-05-05 01:58:00.188650"], ["id", 1]]