app/controllers/user_wishlists_controller.rb

  def index
    @user_wishlists = UserWishlist.all
---
SELECT "user_wishlists".* FROM "user_wishlists" WHERE (user_id = 1)

  def create
    @user_wishlist = UserWishlist.new(user_wishlist_params)

    respond_to do |format|
      if @user_wishlist.save
---
INSERT INTO "user_wishlists" ("user_id", "project_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["user_id", 2], ["project_id", 1], ["created_at", "2018-04-13 23:51:11.051937"], ["updated_at", "2018-04-13 23:51:11.051937"]]

  def destroy
    @user_wishlist.destroy
---
DELETE FROM "user_wishlists" WHERE "user_wishlists"."id" = ?  [["id", 5]]

    def set_user_wishlist
      @user_wishlist = UserWishlist.find(params[:id])
---
SELECT  "user_wishlists".* FROM "user_wishlists" WHERE "user_wishlists"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]