app/controllers/welcome_controller.rb

SELECT "projects".* FROM "projects" WHERE "projects"."outstanding" = ?  [["outstanding", "t"]]
---
  def index
    @projects = Project.where(outstanding: true)